<template>
  <div>
    <h2>
      Home page
    </h2>

    <p>
      В некоторых случаях нам может понадобиться «двусторонняя привязка» для входных параметров. К сожалению, настоящая
      двусторонняя привязка может создавать проблемы с поддержкой, поскольку дочерние компоненты смогут мутировать
      состояние родителя без источника, который является очевидным как у родителя, так и у потомков.
    </p>
    <router-link to="/todos">
      Go to Todos
    </router-link>
  </div>
</template>

<script>
  export default {
    name: "Home"
  }
</script>

<style scoped>

</style>
